In [2]:
import json
with open("practice.json", "r") as f:
    data = json.load(f)
    print(data)

{'company': 'TechVision', 'employees': [{'id': 1, 'name': 'Ali', 'department': 'IT', 'salary': 75000, 'address': {'city': 'Lahore', 'country': 'Pakistan'}}, {'id': 2, 'name': 'Sara', 'department': 'HR', 'salary': 58000, 'address': {'city': 'Karachi', 'country': 'Pakistan'}}, {'id': 3, 'name': 'Ahmed', 'department': 'Sales', 'salary': 42000, 'address': {'city': 'Islamabad', 'country': 'Pakistan'}}]}

In [12]:
print(data["company"])

TechVision

In [8]:
print(data["employees"][2]["address"]['city'])

Islamabad

In [9]:
for emp in data["employees"]:
    print(emp["name"],emp["department"],emp["salary"])

Ali IT 75000
Sara HR 58000
Ahmed Sales 42000

In [10]:
import pandas as pd
df=pd.json_normalize(data["employees"],sep='_')
print(df)

   id   name department  salary address_city address_country
0   1    Ali         IT   75000       Lahore        Pakistan
1   2   Sara         HR   58000      Karachi        Pakistan
2   3  Ahmed      Sales   42000    Islamabad        Pakistan

How many employees are in each department?

In [14]:
df.groupby("department")["id"].count().reset_index(name="employee_count")

  department  employee_count
0         HR               1
1         IT               1
2      Sales               1

Average salary per department

In [16]:
df.groupby("department")["salary"].mean().reset_index(name="average_salary")

  department  average_salary
0         HR         58000.0
1         IT         75000.0
2      Sales         42000.0

Salary distribution (CASE WHEN logic)

In [ ]:
df["salary"].value_counts()

salary
75000    1
58000    1
42000    1
Name: count, dtype: int64

In [20]:
df["eligible"] = (
    ((df["department"] == "IT") & (df["salary"] >= 70000)) |
    ((df["department"] == "HR") & (df["salary"] >= 55000))
)

In [21]:
print(df["eligible"])

0     True
1     True
2    False
Name: eligible, dtype: bool